Контекст 

Тестуємо фічу: бейдж "Залишилося мало товару" на сторінці товару

Метрики

Primary: CR (conversion rate) — чи зросте ймовірність покупки

Guardrail: AOV (average order value) — чи не впаде середній чек через імпульсні 
дешевші покупки

Гіпотеза: 
Н0:фіча не впливає на конверсію
Н1:конверсія зросте

Логіка: Користувач бачить сигнал дефіцит товару, це підштовхує швидше прийняти
рішення про покупки - conversion ↑, але частина користувачів може купувати 
товари імпульсивно - AOV ↓

Потенційний ризик - конверсія росте, але середній чек падає - загальний дохід
може не вирости. 

А/В тест 10

library(boot)
library(pwr)
library(dplyr)

set.seed(54321)

#1. sample size

p1 <- 0.12 # базова конверсія (наприклад mid сегмент або середнє)
p2 <- 0.12 * 1.1 # очікуємо +10% uplift

h <- ES.h(p1, p2)

n <- ceiling(pwr.2p.test(h = h, sig.level = 0.05, power = 0.8)$n * 2) # скільки потрібно юзерів

# 2. Дані

df <- data.frame(
  group = sample(c("A", "B"), n, replace = T),
  segment = sample(c("low", "mid", "high"), n, replace = T, prob = c(0.5, 0.3, 0.2)),
  day = sample(1:21, n, replace = T))

# 2.1 SRM check (чи рівні групи)

chisq.test(table(df$group), p = c(0.5, 0.5))

Показник р становить 1, що свідчить про те, що перекосу між групами немає.

# 2.2 Balance check (чи рівномірні сегменти)

chisq.test(table(df$group, df$segment))

показник р становить 0,13796, що значить, що сегменти між обома групами розподілені
рівномірно

# 3. Conversion (0/1 — купив чи ні)

df$prob <- 0

# група А

df$prob[df$group == "A" & df$segment == "high"] <- 0.16
df$prob[df$group == "A" & df$segment == "mid"] <- 0.12
df$prob[df$group == "A" & df$segment == "low"] <- 0.09

# група В

df$prob[df$group == "B" & df$segment == "high"] <- 0.176
df$prob[df$group == "B" & df$segment == "mid"] <- 0.132
df$prob[df$group == "B" & df$segment == "low"] <- 0.099

# Генерація

df$converted <- rbinom(n, 1, df$prob)

# 4. AOV(тільки для тих, хто купив)

df$aov <- 0
idx <- df$converted == 1

meanlog_vec <- ifelse(df$segment == "high", log(1200),
               ifelse(df$segment == "mid", log(800), log(600)))

df$aov[idx] <- rlnorm(sum(idx), meanlog = meanlog_vec[idx], sdlog = 0.25)

# сезонність (вихідні дані дещот сильніші)

df$aov[idx] <- df$aov[idx] * ifelse(df$day[idx] %in% c(5, 12, 19), 1.15, 1)

# treatment (ефект фічі)

treat_idx <- idx & df$group == "B"

df$aov[treat_idx] <- df$aov[treat_idx] * runif(sum(treat_idx), 0.90 ,0.98)

# outliers(Деякий відсоток дуже великих значеннь)

out_idx <- sample(which(idx), size = round(0.05 * sum(idx)))

df$aov[out_idx] <- df$aov[out_idx] * runif(length(out_idx), 4, 9)

# 5. основні тести

# Правило прийняття рішеннь перед аналізом:
# p-value для SRM > 0.05
# Основна метрика(converted): p-value < 0.05
# 95% bootstrap довірчий інтервал для uplift не включає 0
# AOV не є статистично значуще гіршою, ніж в контрольній групі

# AOV(guardrail - метрика)

t.test(aov~group, data = df[df$converted == 1, ])

Показник р становить 0,008755, що свідчить про те, що існує статистично 
значуща різниця між обома групами. Тобто, середній чек змінився під дією
впровадження нової фічі

# converted(Primary метрика)

conv <- prop.test(table(df$group, df$converted)[ ,2],
          rowSums(table(df$group, df$converted)))

показник р становить 0,00568, що свідчить про те, що існує статистично значуща
різниця між обома групами.

# uplift(на скільки % змінилось)

uplift <- with(df, (mean(converted[df$group == "B"]) 
              - mean(converted[df$group == "A"]))
              / mean(converted[df$group == "A"]))

Отже величина спосережуваного ефекту становить 10,16%. Тобто, конверсія в групі
В на вищезазначену величину вища, ніж в групі А.

# 6. Bootstrap CI (наскільки стабільний ефект)

boot_fn <- function(d,i) {
  x <- d[i, ]
  (mean(x$converted[x$group == "B"]) - mean(x$converted[x$group == "A"])) / 
    mean(x$converted[x$group == "A"])
}

boot_res <- boot(df, boot_fn, R = 1000)

ci <- quantile(boot_res$t, c(0.025, 0.975))

Отже, довірчі інтервали не включають в себе 0, що значить, що ефект є стійким 
та статистично значущим

# 7. Висновки

У ході А/В тесту було проведено зміни в групі В на середній чек та на конверсію.

SRM та баланс сегментів не виявлили статистично значущих відмінностей, що значить,
що групи сформовані корректно

Середній чек (AOV): Показник р становить 0,008755, що означає наявність статистично
значущої різниці між групами за AOV.

Конверсія: Показник р становить 0,00568, що означає наявність статистично
значущої різниці між групами. Тобто, фіча вплинула на дану метрику.

Uplift: Спостерігається помірний uplift(10.16%), він є статистично 
підтвердженим

Довірчий інтервал: не включає в себе 0, що значить, що ефект є стійким та
статистично значущим

Згідно з попередньо визначеним правилом прийняття рішення, основна метрика 
досягла статистичної значущості.

Фінальне рішення: фічу не запускати, оскільки guardrail-метрика AOV була
статистично значуще погіршена в групі B. Отже, фіча у поточному вигляді має
негативний вплив на середній чек.

